app/Models/AccesoModel.php

INSERT INTO `scp_logaccesos` (`log_idusuario`, `log_nombreusuario`, `log_fechaentrada`, `log_timeentrada`, `log_origen`, `log_ipusuario`, `log_plataforma`, `log_browser`, `log_version`, `log_esmovil`) VALUES ('1', 'Administrador', '2024-12-04', '00:58:14', 'local', '::1', 'Windows 10', 'Chrome', '131.0.0.0', 'NO')
---
    function guardaLog($arrayDatosInsert)
    {
        $this->db->table('scp_logaccesos')->insert($arrayDatosInsert);