app/Models/UsuariosModel.php

    public function getDatosUsuarios($limit, $offset, $search = '', $orderColumn = 'usu_id', $orderDir = 'asc')
    {
        $filtros          = session()->get('filtros');
        $filtros          = json_decode($filtros, true);
        $columnasBusqueda = ['usu_login', 'usu_nombre', 'usu_apaterno', 'usu_amaterno', 'rol_nombre', 'usu_correo'];
        $table            = 'scp_usuarios';
        $builder          = $this->db->table($table);

        // Seleccionar columnas para la consulta
        $builder->select("usu_id as id,usu_login as login, CONCAT(COALESCE(usu_nombre,''),' ',COALESCE(usu_apaterno,''),' ',COALESCE(usu_amaterno,'')) as nombre, rol_nombre as rolNombre, usu_correo correo, case usu_estatuscuenta when 1 then 'Activa' when 0 then 'Inactiva' end as estatusCuenta");
        $builder->join('scp_roles', 'rol_id = usu_rol', 'left');


        // Aplicar filtro de búsqueda en columnas específicas
        if (!empty($search)) {
            $builder->groupStart();
            foreach ($columnasBusqueda as $column) {
                $builder->orLike($column, $search);
            }
            $builder->groupEnd();
        }

        // Contar registros totales sin filtrar
        $totalRecords = $builder->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `scp_usuarios`
LEFT JOIN `scp_roles` ON `rol_id` = `usu_rol`
WHERE   (
`usu_login` LIKE '%nuevo%' ESCAPE '!'
OR  `usu_nombre` LIKE '%nuevo%' ESCAPE '!'
OR  `usu_apaterno` LIKE '%nuevo%' ESCAPE '!'
OR  `usu_amaterno` LIKE '%nuevo%' ESCAPE '!'
OR  `rol_nombre` LIKE '%nuevo%' ESCAPE '!'
OR  `usu_correo` LIKE '%nuevo%' ESCAPE '!'
 )

    function getRoles()
    {
        $builder = $this->db->table('scp_roles');
        $builder->select('rol_id as id,rol_nombre as nombre');
        $roles = $builder->get()->getResultArray();
---
SELECT `rol_id` as `id`, `rol_nombre` as `nombre`
FROM `scp_roles`

    function agregaUsuario($datosUsuario)
    {
        $respuesta = false;
        $builder   = $this->db->table('scp_usuarios');
        $builder->insert($datosUsuario);
---
INSERT INTO `scp_usuarios` (`usu_login`, `usu_nombre`, `usu_apaterno`, `usu_amaterno`, `usu_correo`, `usu_rol`, `usu_estatuscuenta`) VALUES ('nuevo', 'nuevo', 'nuevo', '', '', '3', '0')